УправлениПарком/src/DataProcessors/ФормаСозданнаяПрограммно/ФормаСозданнаяПрограммно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормаСозданнаяПрограммно</name>
</mdclass:DataProcessor>

УправлениПарком/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УправлениПарком/src/DataProcessors/ФормаСозданнаяПрограммно/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Форма = ЭтотОбъект;
	
	стрРеквизитов = Новый Структура;
	стрРеквизитов.Вставить("Дата",ДФИ.ОписаниеТипаДатаВремя());
	стрРеквизитов.Вставить("Номер",ДФИ.ОписаниеТипаСтрока(11));
	стрРеквизитов.Вставить("Комментарий",ДФИ.ОписаниеТипаСтрока(100));
	стрРеквизитов.Вставить("ПлатнаяДоставка",ДФИ.ОписаниеТипаБулево());
	стрРеквизитов.Вставить("ТолькоБудни",ДФИ.ОписаниеТипаБулево());
	стрРеквизитов.Вставить("Покупатель",ДФИ.ОписаниеТипаСправочник("Контрагенты"));
	стрРеквизитов.Вставить("Товары",ДФИ.ОписаниеТипаТаблицаЗначений());
	стрРеквизитов.Вставить("ПолКурьера",ДФИ.ОписаниеТипаПеречисление("ПолФизическогоЛица"));
	ДФИ.СоздатьРеквизиты(Форма,стрРеквизитов);
	
	стрРеквизитовТЧ = Новый Структура;
	стрРеквизитовТЧ.Вставить("Товар",ДФИ.ОписаниеТипаСправочник("Номенклатура"));
	стрРеквизитовТЧ.Вставить("Количество",ДФИ.ОписаниеТипаЧисло(10));
	стрРеквизитовТЧ.Вставить("Цена",ДФИ.ОписаниеТипаЧисло(10,2));
	стрРеквизитовТЧ.Вставить("Упаковать",ДФИ.ОписаниеТипаБулево());
	стрРеквизитовТЧ.Вставить("Стекло",ДФИ.ОписаниеТипаБулево());	
	ДФИ.СоздатьРеквизитыТаблицы(Форма,"Товары",стрРеквизитовТЧ);
	
	ГруппаШапка = ДФИ.СздГруппаОбычнаяБезОтображения(Форма,"ГруппаШапка",Форма,3,1);
	ГруппаШапкаЛево = ДФИ.СздГруппаОбычнаяБезОтображения(Форма,"ГруппаШапкаЛево",ГруппаШапка,1); 
	ГруппаШапкаПраво = ДФИ.СздГруппаОбычнаяБезОтображения(Форма,"ГруппаШапкаПраво",ГруппаШапка,1);
	ГруппаСтраниц = ДФИ.СздГруппаСтраниц(Форма,"ГруппаСтраниц",Форма,1,1);
	ГруппаТовары = ДФИ.СздСтраница(Форма,"ГруппаТовары",ГруппаСтраниц,"Товары",,1,1);
	ГруппаЗаказы = ДФИ.СздСтраница(Форма,"ГруппаЗаказы",ГруппаСтраниц,"Заказы клиента",,1,1);
	ГруппаПодвал = ДФИ.СздГруппаОбычнаяБезОтображения(Форма,"ГруппаПодвал",Форма,3);
	
	ВысотаТаблицы = ДФИ.СтруктураСвойствТаблицыФормы(,,,,,,,4);
	
	ДФИ.СздДекорацияКартинка(Форма,"КартинкаЛоготип",ГруппаШапкаЛево,"Логотип1СОтчетность");
	ДФИ.СздПоле(Форма,"Дата",ГруппаШапкаЛево,"Дата документа",1,"Дата");
	НовыйЭлемент = ДФИ.СздПоле(Форма,"Номер",ГруппаШапкаЛево,,1,"Номер");
	ДФИ.СздПоле(Форма,"Покупатель",ГруппаШапкаПраво,,1,"Покупатель");
	ДФИ.СздПоле(Форма,"ПлатнаяДоставка",ГруппаШапкаПраво,"Платная доставка",2,"ПлатнаяДоставка");
	ДФИ.СздПолеФлажок(Форма,"ТолькоБудни",ГруппаШапкаПраво,"Только будни",3,"ТолькоБудни");
	ДФИ.СздПоле(Форма,"ПолКурьера",ГруппаШапкаПраво,"Пол курьера",1,"ПолКурьера");
	
	ШиринаПоля = ДФИ.СтруктураСвойствРасположение(10,,,10,ЛОЖЬ,,ЛОЖЬ);
	ОсновныеНастройкиПоля = ДФИ.СтруктураСвойствОсновные(,,,,,,ИСТИНА);
	ДФИ.УстановитьМножествоСтруктурСвойствЭлементу(НовыйЭлемент,ШиринаПоля,ОсновныеНастройкиПоля);
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("Обычная");
	МассивЗначений.Добавить("Срочно");
	МассивЗначений.Добавить("Ракета");	
	ДФИ.СздПереключатель(Форма,"СрочностьДоставки",ГруппаШапкаЛево,"Срочность",МассивЗначений,1);
		
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("Седан");
	МассивЗначений.Добавить("Универсал");
	МассивЗначений.Добавить("Грузовик");
	ДФИ.СздВыпадающийСписок(Форма,"ВыборТС",ГруппаШапкаПраво,"Тип ТС",МассивЗначений);
	
	стрКолонок = Новый Структура;
	стрКолонок.Вставить("Товар","");
	стрКолонок.Вставить("Количество","");
	стрКолонок.Вставить("Цена","");
	НовыйЭлемент = ДФИ.СздТаблицаФормы(Форма,"Товары",ГруппаТовары,"Товары",стрКолонок);
	
	ГруппаКолонки = ДФИ.СздГруппаКолонокТаблицыФормы(Форма,"ГруппаДополнительно",НовыйЭлемент,2,,,"Дополнительно");
	ДФИ.СздКолонкаТаблицыФормы(Форма,"Упаковать",ГруппаКолонки,2,"Упаковать","Товары.Упаковать");
	ДФИ.СздКолонкаТаблицыФормы(Форма,"Стекло",ГруппаКолонки,2,"Стекло","Товары.Стекло");
	
	ДФИ.УстановитьСвойстваЭлементу(НовыйЭлемент,ВысотаТаблицы);
	
	ДФИ.СздДекорацияНадпись(Форма,"ИнформационнаяНадпись",ГруппаЗаказы,"Заказы по клиенту с начала года",1);
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗаказКлиента.Ссылка КАК Ссылка,
	               |	ЗаказКлиента.Номер КАК Номер,
	               |	ЗаказКлиента.Дата КАК Дата,
	               |	ЗаказКлиента.Контрагент КАК Контрагент,
	               |	ЗаказКлиента.СуммаДокумента КАК Сумма
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Дата > &Дата";
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Дата",НачалоГода(ТекущаяДата()));
	стрКолонок = Новый Структура;
	стрКолонок.Вставить("Дата","");
	стрКолонок.Вставить("Номер","");
	стрКолонок.Вставить("Контрагент","Покупатель");	
	стрКолонок.Вставить("Сумма","");
	НовыйЭлемент = ДФИ.СздДинамическийСписок(Форма,"Заказы",ГруппаЗаказы,ТекстЗапроса,ПараметрыЗапроса,,стрКолонок,,,ИСТИНА);
	
	ДФИ.УстановитьСвойстваЭлементу(НовыйЭлемент,ВысотаТаблицы);
	
	ДФИ.СздПоле(Форма,"Комментарий",ГруппаПодвал,,1,"Комментарий");
	
	ДФИ.СоздатьКоманду(Форма,"ПриветИнфостарт","Проверка","СообщитьПриветИнфостарт");
	ДФИ.СздКнопка(Форма,"Проверка",ГруппаПодвал,"Поздароваться","ПриветИнфостарт",2);
	
	ДФИ.СоздатьКоманду(Форма,"УдалитьЭлемент","Удалить дату","УдалитьЭлемент");
	ДФИ.СздКнопка(Форма,"УдалитьЭлемент",ГруппаПодвал,,"УдалитьЭлемент",1);
	
	ДФИ.СоздатьКоманду(Форма,"СоздатьЭлемент","Создать дату","СоздатьЭлемент");
	ДФИ.СздКнопка(Форма,"СоздатьЭлемент",ГруппаПодвал,,"СоздатьЭлемент",1);	
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПриветИнфостарт(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Привет Инфостарт!";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
	УдалитьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементНаСервере()
	ДФИ.УдлРеквизитИЭлемент(ЭтотОбъект,"Дата");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлемент(Команда)
	СоздатьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементНаСервере()
	стрРеквизитов = Новый Структура;
	стрРеквизитов.Вставить("Дата",ДФИ.ОписаниеТипаДатаВремя());
	ДФИ.СоздатьРеквизиты(ЭтотОбъект,стрРеквизитов);	
	ДФИ.СздПоле(ЭтотОбъект,"Дата","ГруппаШапкаЛево","Дата документа",1,"Дата");
КонецПроцедуры
